var data=[];

var dataStr='1、霍比特人1<br>\
<br>\
导演：彼特.杰克逊<br>\
编剧：弗兰.威尔士 / 费力拍.鲍恩斯 /彼得.杰克逊/吉尔莫.德尔.托罗 /J.R.R.托儿金 <br>\
主演：马丁.非瑞曼 /伊恩.麦克莱恩 /理查德.阿米蒂奇 /伊万杰琳.莉莉 <br>\
类型：动作/奇幻/冒险<br>\
制片国家/地区：美国/新西兰<br>\
语言：英语<br>\
上映日期: 2015-01-23（中国大陆）/2017-12-17（美国<br>\
片长：144分钟<br>\
<br>\
<br>\
2、霍比特人2<br>\
<br>\
导演：彼特.杰克逊<br>\
编剧：弗兰.威尔士 / 费力拍.鲍恩斯 /彼得.杰克逊/吉尔莫.德尔.托罗 /J.R.R.托儿金 <br>\
主演：马丁.非瑞曼 /伊恩.麦克莱恩 /理查德.阿米蒂奇 /伊万杰琳.莉莉 <br>\
类型：动作/奇幻/冒险<br>\
制片国家/地区：美国/新西兰<br>\
语言：英语<br>\
上映日期: 2015-01-23（中国大陆）/2017-12-17（美国）<br>\
片长：144分钟<br> \
<br>\
<br>\
3、霍比特人3<br>\
<br>\
导演：彼特.杰克逊<br>\
编剧：弗兰.威尔士 / 费力拍.鲍恩斯 /彼得.杰克逊/吉尔莫.德尔.托罗 /J.R.R.托儿金 <br>\
主演：马丁.非瑞曼 /伊恩.麦克莱恩 /理查德.阿米蒂奇 /伊万杰琳.莉莉 <br>\
类型：动作/奇幻/冒险<br>\
制片国家/地区：美国/新西兰<br>\
语言：英语<br>\
上映日期: 2015-01-23（中国大陆）/2017-12-17（美国）<br>\
片长：144分钟<br>\
<br>\
<br>\
4、霍比特人4<br>\
<br>\
导演：彼特.杰克逊<br>\
编剧：弗兰.威尔士 / 费力拍.鲍恩斯 /彼得.杰克逊/吉尔莫.德尔.托罗 /J.R.R.托儿金 <br>\
主演：马丁.非瑞曼 /伊恩.麦克莱恩 /理查德.阿米蒂奇 /伊万杰琳.莉莉 <br>\
类型：动作/奇幻/冒险<br>\
制片国家/地区：美国/新西兰<br>\
语言：英语<br>\
上映日期: 2015-01-23（中国大陆）/2017-12-17（美国）<br>\
片长：144分钟<br>\
<br>\
<br>\
5、霍比特人5<br>\
<br>\
导演：彼特.杰克逊<br>\
编剧：弗兰.威尔士 / 费力拍.鲍恩斯 /彼得.杰克逊/吉尔莫.德尔.托罗 /J.R.R.托儿金 <br>\
主演：马丁.非瑞曼 /伊恩.麦克莱恩 /理查德.阿米蒂奇 /伊万杰琳.莉莉 <br>\
类型：动作/奇幻/冒险<br>\
制片国家/地区：美国/新西兰<br>\
语言：英语<br>\
上映日期: 2015-01-23（中国大陆）/2017-12-17（美国）<br>\
片长：144分钟<br>\
<br>\
<br>\
6、霍比特人6<br>\
<br>\
导演：彼特.杰克逊<br>\
编剧：弗兰.威尔士 / 费力拍.鲍恩斯 /彼得.杰克逊/吉尔莫.德尔.托罗 /J.R.R.托儿金 <br>\
主演：马丁.非瑞曼 /伊恩.麦克莱恩 /理查德.阿米蒂奇 /伊万杰琳.莉莉 <br>\
类型：动作/奇幻/冒险<br>\
制片国家/地区：美国/新西兰<br>\
语言：英语<br>\
上映日期: 2015-01-23（中国大陆）/2017-12-17（美国）<br>\
片长：144分钟<br>\
<br>\
<br>\
7、霍比特人7<br>\
<br>\
导演：彼特.杰克逊<br>\
编剧：弗兰.威尔士 / 费力拍.鲍恩斯 /彼得.杰克逊/吉尔莫.德尔.托罗 /J.R.R.托儿金 <br>\
主演：马丁.非瑞曼 /伊恩.麦克莱恩 /理查德.阿米蒂奇 /伊万杰琳.莉莉 <br>\
类型：动作/奇幻/冒险<br>\
制片国家/地区：美国/新西兰<br>\
语言：英语<br>\
上映日期: 2015-01-23（中国大陆）/2017-12-17（美国）<br>\
片长：144分钟<br>\
<br>\
<br>\
8、霍比特人8<br>\
<br>\
导演：彼特.杰克逊<br>\
编剧：弗兰.威尔士 / 费力拍.鲍恩斯 /彼得.杰克逊/吉尔莫.德尔.托罗 /J.R.R.托儿金 <br>\
主演：马丁.非瑞曼 /伊恩.麦克莱恩 /理查德.阿米蒂奇 /伊万杰琳.莉莉 <br>\
类型：动作/奇幻/冒险<br>\
制片国家/地区：美国/新西兰<br>\
语言：英语<br>\
上映日期: 2015-01-23（中国大陆）/2017-12-17（美国）<br>\
片长：144分钟<br>\
<br>\
<br>\
9、霍比特人9<br>\
<br>\
导演：彼特.杰克逊<br>\
编剧：弗兰.威尔士 / 费力拍.鲍恩斯 /彼得.杰克逊/吉尔莫.德尔.托罗 /J.R.R.托儿金 <br>\
主演：马丁.非瑞曼 /伊恩.麦克莱恩 /理查德.阿米蒂奇 /伊万杰琳.莉莉 <br>\
类型：动作/奇幻/冒险<br>\
制片国家/地区：美国/新西兰<br>\
语言：英语<br>\
上映日期: 2015-01-23（中国大陆）/2017-12-17（美国）<br>\
片长：144分钟<br>\
<br>\
<br>\
10、霍比特人10<br>\
<br>\
导演：彼特.杰克逊<br>\
编剧：弗兰.威尔士 / 费力拍.鲍恩斯 /彼得.杰克逊/吉尔莫.德尔.托罗 /J.R.R.托儿金 <br>\
主演：马丁.非瑞曼 /伊恩.麦克莱恩 /理查德.阿米蒂奇 /伊万杰琳.莉莉 <br>\
类型：动作/奇幻/冒险<br>\
制片国家/地区：美国/新西兰<br>\
语言：英语<br>\
上映日期: 2015-01-23（中国大陆）/2017-12-17（美国）<br>\
片长：144分钟<br>\
<br>\
<br>\
11、霍比特人11<br>\
<br>\
导演：彼特.杰克逊<br>\
编剧：弗兰.威尔士 / 费力拍.鲍恩斯 /彼得.杰克逊/吉尔莫.德尔.托罗 /J.R.R.托儿金 <br>\
主演：马丁.非瑞曼 /伊恩.麦克莱恩 /理查德.阿米蒂奇 /伊万杰琳.莉莉 <br>\
类型：动作/奇幻/冒险<br>\
制片国家/地区：美国/新西兰<br>\
语言：英语<br>\
上映日期: 2015-01-23（中国大陆）/2017-12-17（美国）<br>\
片长：144分钟<br>\
<br>\
<br>\
12、霍比特人12<br>\
<br>\
导演：彼特.杰克逊<br>\
编剧：弗兰.威尔士 / 费力拍.鲍恩斯 /彼得.杰克逊/吉尔莫.德尔.托罗 /J.R.R.托儿金 <br>\
主演：马丁.非瑞曼 /伊恩.麦克莱恩 /理查德.阿米蒂奇 /伊万杰琳.莉莉 <br>\
类型：动作/奇幻/冒险<br>\
制片国家/地区：美国/新西兰<br>\
语言：英语<br>\
上映日期: 2015-01-23（中国大陆）/2017-12-17（美国）<br>\
片长：144分钟<br>\
';
var d=dataStr.split('<br><br><br>')
for(var i=0;i<d.length;i++){
    var c=d[i].split('<br><br>');
    data.push({
        img:c[0].replace('、',' ')+'.jpg',
        caption: c[0].split('、')[1],
        desc: c[1]
    });
    console.log(c[0].replace('、',' ')+'.jpg');
}